{"data":{"talk":{"html":"<p>Das Framework <a href=\"https://github.com/google/guava\">Guava</a> wurde von Google geschaffen, um eine einheitliche und einfach zu\nhandhabende Lösung für verschiedenste alltäglich wiederkehrende Probleme anzubieten. Insbesondere für die Codebasis von\nGoogle selbst. Dabei wurde großen Wert darauf gelegt ältere JDK-Versionen 5+ (ab Release 12 inzwischen JDK 6+) zu\nunterstützen. Damit ist Guava ein Framework, mit dem sich jeder JAVA-Entwickler näher beschäftigen sollte, um sich die\neigene Arbeit zu erleichtern.</p>\n<p>Auch wenn inzwischen einige Features mit JDK 7 (wie bspw. die Klasse Objects) und JDK 8 (wie bspw. Funktionale Ansätze)\nin ähnlicher Form inzwischen auch direkt in JAVA nutzbar sind, lohnt die Verwendung von Guava immernoch. Zudem ist Guava\nnicht als Konkurrenz zu Lösungen des JDKs oder ähnlicher Libaries wie Apache Commons zu verstehen, sondern als\nsymbiotische Ergänzung.</p>\n<p>Zu einer solchen Ergänzung zählt definitiv die umfangreiche Erweiterung der JDK-Collection-Vielfalt um viele weitere\nnützliche Typen zu den Vozügen von Guava. Insbesondere kann der spezielle Ansatz bei deren Verarbeitung immernoch\nVorteile gegenüber Streams bieten. Andersherum lassen viele Dinge in Guava mit Lambdas inzwischen noch komfortabler\nbedienen.</p>\n<p>In dem Vortrag wird ein Überblick über die zahlreichen Möglichkeiten von Guava gegeben. Auch unter dem Gesichtspunkt der\nneuen Möglichkeiten unter JDK 7/8. Die genannte Collection-Erweiterung ist dabei nur ein Bruchteil dessen was Guava\nbietet. (Object- und StringUtils, Orderings, Comparisons, Preconditions, ExceptionHandler, neue Collections und ihr\nHandling, Funktionale Ansätze, Ranges, ReflectionUtils)</p>","fields":{"slug":"/talks/2015-09-30-guava/"},"frontmatter":{"title":"Guava","date":"2015-09-30T00:00:00.000Z","tags":["java"],"poster":null}},"speakers":{"edges":[{"node":{"id":"405dccf5-4ca8-5fd1-93a2-4ea7e13181c6","html":"","frontmatter":{"name":"Steffen Seidler","pic":null,"twitter_name":null},"fields":{"slug":"/speakers/steffen_seidler/"}}}]},"location":{"fields":{"slug":"/locations/dser_elisabethstrasse/"},"frontmatter":{"name":"DSER","number":"42/43","info":null,"zip":"02826","city":"Görlitz","street":"Elisabethstraße"}}},"pageContext":{"slug":"/talks/2015-09-30-guava/","speakerSlugs":["/speakers/steffen_seidler/"],"locationSlug":"/locations/dser_elisabethstrasse/"}}