{"data":{"talk":{"html":"<p>Kaum haben wir uns von dem klassischen Monolithen und der zugehörigen Ablaufumgebung namens Application Server,\nzugunsten von Microservices und Embedded Runtimes, verabschiedet, taucht am Horizont mit Serverless Applications bzw.\nArchitectures schon die nächste Evolutionsstufe auf. Was bitte ist das jetzt schon wieder? Und wer braucht so etwas? Die\nSession zeigt, wie sich dank BaaS, FaaS und einiger anderer Akronyme, Mobile und Enterpriese Anwendungen implementieren\nlassen - ganz ohne Server! Ganz ohne? Naja, fast.</p>\n<p><a href=\"https://www.dropbox.com/s/nrt9jb5mtwkxh2s/se_serverless.pdf\">Folien zum Vortrag</a></p>\n<hr>\n<p>Bei bei diesem Treffen verlosen wir unter den Teilnehmern ein Tutorial von\n<a href=\"https://tutorials.entwickler.de/\">https://tutorials.entwickler.de/</a>. Mit freundlicher Unterstützung durch <strong>Software &#x26;\nSupport Media GmbH</strong>.</p>","fields":{"slug":"/talks/2017-10-25-serverless/"},"frontmatter":{"title":"Serverless Application - Who the heck needs a Server?","date":"2017-10-25T00:00:00.000Z","tags":["architektur"],"poster":"/images/plakat_2017_10.png"}},"speakers":{"edges":[{"node":{"id":"561443f4-ac76-5848-951e-23358cd64a6a","html":"<p>Lars Röwekamp, Gründer des IT-Beratungs- und Entwicklungsunternehmens open knowledge GmbH, beschäftigt sich im Rahmen\nseiner Tätigkeit als \"CIO New Technologies\" mit der eingehenden Analyse und Bewertung neuer Software- und\nTechnologietrends. Ein besonderer Schwerpunkt seiner Arbeit liegt derzeit in den Bereichen Enterprise und Mobile\nComputing, wobei neben Design- und Architekturfragen insbesondere die Real-Life-Aspekte im Fokus seiner Betrachtung\nstehen. Lars Röwekamp, Autor mehrerer Fachartikel und -bücher, beschäftigt sich seit der Geburtsstunde von Java mit\ndieser Programmiersprache, wobei er einen Großteil seiner praktischen Erfahrungen im Rahmen großer internationaler\nProjekte sammeln konnte.</p>","frontmatter":{"name":"Lars Röwekamp","pic":"/images/lars_roewekamp.png","twitter_name":"mobileLarson"},"fields":{"slug":"/speakers/lars_roewekamp/"}}}]},"location":{"fields":{"slug":"/locations/hochschule_campus/"},"frontmatter":{"name":"Hochschule Zittau/Görlitz","info":"Haus G2 Raum 0.10","zip":"02826","city":"Görlitz","street":"Brückenstraße"}}},"pageContext":{"slug":"/talks/2017-10-25-serverless/","speakerSlugs":["/speakers/lars_roewekamp/"],"locationSlug":"/locations/hochschule_campus/"}}