{"data":{"talk":{"html":"<p>Nach der Ausdehnung vom JDK 9 Feature-Complete-Status, begann die Fehlerbereinigung, mit allen notwendigen Vorarbeiten,\num den finalen Release-Candidate für das JDK 9 bereitzustellen. Der Schwerpunkt vom JDK 9 liegt bei der neuen\nPlattformmodularisierung mit dem Projekt Jigsaw. Über die JDK-Enhancement-Vorschläge JEP 200 (Modulares JDK), JEP 201\n(Modularer Source-Code) und JEP 220 (Modulare Laufzeit-Images) gelangen die technischen Vorschläge ins JDK 9. Der JSR\n376 (Java Platform Module System) schafft die Grundlage für die Referenzimplementierung vom OpenJDK Projekt Jigsaw.\nDiese Veränderungen lassen es zu, mit dem JDK 9 die gewünschte technische Paketierung von ausgewählter\nJava-Funktionalität selbst zu bestimmen. Das Projekt Jigsaw hat die primäre Aufgabe, das Design und die Implementierung\neines Standard-Modulsystems für die Java-Plattform und für das JDK 9 bereitzustellen. Dabei soll die durchgängige,\ndynamische und einfache Anpassbarkeit der Java-SE-Plattform &#x26; dem JDK, auch für kleine Endgeräte berücksichtigt werden,\nsowie die Verbesserung von Sicherheit und Wartbarkeit von Java-SE-Plattform-Implementierungen, speziell vom JDK,\nverwirklicht werden. Im Vortrag werden Demo-Beispiele gezeigt, die eine Erstellung von individueller Java Runtime mit\nAnwendung anhand der JDK 9-Werkzeuge verdeutlichen. Die geplante Verfügbarkeit vom JDK 9 ist für Ende Juli 2017\nvorgesehen.</p>\n<p><a href=\"http://jug-gr.de/downloads/juggr_JDK_9_Java_Platform_Module_System.pdf\">Folien zum Vortrag</a></p>","fields":{"slug":"/talks/2017-04-26-jdk9/"},"frontmatter":{"title":"JDK 9","date":"2017-04-25T00:00:00.000Z","tags":["java"],"poster":"../images/plakat_2017_04.png"}},"speakers":{"edges":[{"node":{"id":"7e394117-46d2-505a-b866-0af4af7a94fd","html":"<p>Wolfgang Weigend arbeitet als Sen. Leitender Systemberater bei der Oracle Deutschland B.V. &#x26; Co. KG. Er beschäftigt sich\nmit Java-Technologie und -Architektur für unternehmensweite Anwendungsentwicklung.</p>","frontmatter":{"name":"Wolfgang Weigend","pic":"images/wolfgang_weigend.jpg","twitter_name":"wolflook"},"fields":{"slug":"/speakers/wolfgang_weigend/"}}}]},"location":{"fields":{"slug":"/locations/saxsys/"},"frontmatter":{"name":"Saxonia Systems AG","info":null,"zip":"02826","city":"Görlitz","street":"Berliner Straße"}}},"pageContext":{"slug":"/talks/2017-04-26-jdk9/","speakerSlugs":["/speakers/wolfgang_weigend/"],"locationSlug":"/locations/saxsys/"}}