{"data":{"talk":{"html":"<p>React ist eine von Facebook entwickelte JavaScript-Bibliothek zur Entwicklung von UI-Komponenten.\nDabei macht React einiges anders als andere Web-Frameworks, beispielsweise der Verzicht auf Templates und die Limitierung\nauf unidirektionalen Datenfluss. Interessant ist auch der vollständig deklarative Ansatz, der es u.a. ermöglicht,\nUI-Komponenten als Funktionen zu entwickeln.</p>\n<p>React ist aber nicht auf den Browser beschränkt: Mit React-Native können darüber hinaus auf die gleiche Art und Weise\nauch native Mobile-Apps entwickelt werden. Aber anders die meisten HTML5-Hybrid-Frameworks ist bei React-Native kein HTML im Spiel.\nStattdessen werden tatsächlich native UI-Controls gerendert.</p>\n<p>In diesem Vortrag möchte ich React und auch React-Native vorstellen und mittels Live-Coding einen Eindruck\nvon dem Framework vermitteln.\nDabei möchte ich aber auch auf die Ansätze aus der funktionalen Programmierung eingehen, die React meines Erachtens so besonders machen.</p>","fields":{"slug":"/talks/2017-05-31-react/"},"frontmatter":{"title":"React und React-Native: Functional UI Development für Browser und mobile Endgeräte","date":"2017-05-31T00:00:00.000Z","tags":"javascript web mobile","poster":"/images/plakat_2017_05.png"}},"speakers":{"edges":[{"node":{"id":"1bc17afa-9379-5441-9245-72eb6b23c092","html":"<p>Manuel arbeitet als Softwareentwickler bei der Saxonia-Systems AG in Görlitz.\nEr beschäftigt sich mit allen Aspekten der Anwendungsentwicklung, wobei der Fokus auf dem Frontend liegt,\nbeispielsweise mit JavaFX und modernen JavaScript-Frameworks.\nDaneben interessieren ihn Themen wie funktionale Programmierung und Softwarearchitektur.\nManuel ist Gründungsmitglied und Leiter der Java User Group Görlitz und steuert hierfür und\nauch für andere Usergroups und Konferenzen regelmäßig Vorträge bei.</p>","frontmatter":{"name":"Manuel Mauky","pic":"https://lestard.eu/files/pics/me.png","twitter_name":"manuel_mauky"},"fields":{"slug":"/speakers/manuel_mauky/"}}}]},"location":{"fields":{"slug":"/locations/hochschule_campus/"},"frontmatter":{"name":"Hochschule Zittau/Görlitz","info":"Haus G2 Raum 0.10","zip":"02826","city":"Görlitz","street":"Brückenstraße"}}},"pageContext":{"slug":"/talks/2017-05-31-react/","speakerSlugs":["/speakers/manuel_mauky/"],"locationSlug":"/locations/hochschule_campus/"}}