{"data":{"talk":{"html":"<p>Unveränderliche Datenstrukturen sind ein wichtiges Werkzeug der funktionalen Programmierung.\nAber auch abseits dessen können Immutables ungemein nützlich sein: Richtig angewandt erhöhen sie die Verständlichkeit des Codes,\nda EntwicklerInnen nicht mehr auf die mühsame Suche gehen müssen,\nan welcher Stelle ein Objekt möglicherweise ungewollt verändert wurde.\nDarüber hinaus sind Immutables inhärent Threadsafe und können auch hier die Nachvollziehbarkeit des Codes erhöhen.</p>\n<p>Da Java als Sprache aber keine besondere Unterstützung für Immutables mitbringt,\nmüssen EntwicklerInnen auf Patterns und Bibliotheken zurückgreifen, um in den Genuss von unveränderlichen Datenstrukturen zu kommen.\nDenn natürlich müssen auch in funktionalen Programmen letztlich Veränderungen der Daten abgebildet werden und dafür bedarf es geeigneter Unterstützung.</p>\n<p>Im Vortrag möchte ich neben einer grundsätzlichen Einführung in die Thematik auch einige dieser Techniken vorstellen und ihre Vor- und Nachteile besprechen.</p>","fields":{"slug":"/talks/2018-06-27-immutable-data/"},"frontmatter":{"title":"Immutable Data - Unveränderliche Daten im Griff","date":"2018-06-27T00:00:00.000Z","tags":"programmiersprachen","poster":"/images/plakat_2018_06.png"}},"speakers":{"edges":[{"node":{"id":"1bc17afa-9379-5441-9245-72eb6b23c092","html":"<p>Manuel arbeitet als Softwareentwickler bei der Saxonia-Systems AG in Görlitz.\nEr beschäftigt sich mit allen Aspekten der Anwendungsentwicklung, wobei der Fokus auf dem Frontend liegt,\nbeispielsweise mit JavaFX und modernen JavaScript-Frameworks.\nDaneben interessieren ihn Themen wie funktionale Programmierung und Softwarearchitektur.\nManuel ist Gründungsmitglied und Leiter der Java User Group Görlitz und steuert hierfür und\nauch für andere Usergroups und Konferenzen regelmäßig Vorträge bei.\n</p>","frontmatter":{"name":"Manuel Mauky","pic":"https://lestard.eu/files/pics/me.png","twitter_name":"manuel_mauky"}}}]},"location":{"fields":{"slug":"/locations/hochschule_campus/"},"frontmatter":{"name":"Hochschule Zittau/Görlitz","info":"Haus G2 Raum 0.10","street":"Brückenstraße","number":1,"zip":"02826","city":"Görlitz"}}},"pageContext":{"slug":"/talks/2018-06-27-immutable-data/","speakerSlugs":["/speakers/manuel_mauky/"],"locationSlug":"/locations/hochschule_campus/"}}