{"data":{"talk":{"html":"<p>Die meisten Softwareentwickler haben irgendwann einmal <strong>Model-View-Controller</strong> als Design-Pattern gelernt. In der\nPraxis existieren aber viele verschiedene Ansichten darüber, was MVC eigentlich genau bedeutet und wie es implementiert\nwird. Darüber hinaus haben sich mit der Zeit auch neue, eigenständige UI-Design-Patterns entwickelt, die aber oft noch\ngewissen Gemeinsamkeiten mit dem klassischen MVC aufweisen. Dazu gehören z.B. <strong>Model-View-Presenter</strong>,\n<strong>Presentation-Model</strong> und <strong>Model-View-ViewModel</strong>.</p>\n<p>In diesem Vortrag soll zum einen ein Überblick über UI-Design-Patterns gegeben werden, zum anderen aber auch ein\ntieferer Eindruck über die tatsächliche Umsetzung und der praktischen Konsequenzen dieser Patterns gegeben werden. Dabei\nsollen weniger UML-Diagramme als viel mehr Code-Beispiele im Vordergrund stehen. Es wird dabei auch auf Aspekte wie\n<em>Testbarkeit</em>, <em>Koppelung</em> und <em>Wiederverwendung</em> eingegangen.</p>\n<p>Der Vortragende ist Softwareentwickler bei der Saxonia Systems AG und ist dort vor allem im UI-Bereich tätig. Er hat\nErfahrungen gesammelt mit <em>JavaServer-Faces</em>, <em>HTML(5)+JavaScript</em> sowie im Bereich Desktop-Oberflächen mit JavaFX.\nAktuell arbeitet er als Hauptentwickler an dem OpenSource-Framework <a href=\"https://github.com/sialcasa/mvvmFX\">MvvmFX</a>,\nwelches Komponenten zur Umsetzung des Design-Patterns <em>Model-View-ViewModel</em> für JavaFX bereitstellt.</p>\n<ul>\n<li><a href=\"https://github.com/lestard/juggr_model-view-star/raw/master/jug_slides.pdf\">Vortragsfolien</a></li>\n<li><a href=\"https://github.com/lestard/juggr_model-view-star\">Code auf Github</a></li>\n</ul>","fields":{"slug":"/talks/2014-12-03-model-view-star/"},"frontmatter":{"title":"Model-View-*: UI-Design-Patterns im Detail","date":"2014-12-03T00:00:00.000Z","tags":"java","poster":null}},"speakers":{"edges":[{"node":{"id":"1bc17afa-9379-5441-9245-72eb6b23c092","html":"<p>Manuel arbeitet als Softwareentwickler bei der Saxonia-Systems AG in Görlitz.\nEr beschäftigt sich mit allen Aspekten der Anwendungsentwicklung, wobei der Fokus auf dem Frontend liegt,\nbeispielsweise mit JavaFX und modernen JavaScript-Frameworks.\nDaneben interessieren ihn Themen wie funktionale Programmierung und Softwarearchitektur.\nManuel ist Gründungsmitglied und Leiter der Java User Group Görlitz und steuert hierfür und\nauch für andere Usergroups und Konferenzen regelmäßig Vorträge bei.</p>","frontmatter":{"name":"Manuel Mauky","pic":"https://lestard.eu/files/pics/me.png","twitter_name":"manuel_mauky"}}}]},"location":{"fields":{"slug":"/locations/saxsys/"},"frontmatter":{"name":"Saxonia Systems AG","info":null,"zip":"02826","city":"Görlitz","street":"Berliner Straße"}}},"pageContext":{"slug":"/talks/2014-12-03-model-view-star/","speakerSlugs":["/speakers/manuel_mauky/"],"locationSlug":"/locations/saxsys/"}}