{"data":{"talk":{"html":"<p>Während in einer klassischen Konzern-IT Standards und Blaupausen für immer gleiche Anwendungsarchitekturen sorgen,\nbetonen Microservice-Ansätze die technologische Freiheit. Zwei extreme Spielarten der Ausgestaltung von Makro- und\nMikroarchitektur. In diesem Vortrag lernt Ihr neben dem Konzept selbst auch die auf Eure Ziele abgestimmte Richtung, die\nIhr in dieser Fragestellung einschlagen solltet. Wie sieht in Eurem Kontext die Balance aus -- was gebt Ihr für alle\nElemente Eurer Anwendung(slandschaft) vor, wo lasst Ihr bewusst Spielraum? Und gibt es auch noch etwas dazwischen? Zu\ndiesem Zweck passen wir organisatorische und technologische Trends wie 2-Speed/Bimodale Architekturen, Cloud und\nDomänenorientierung in das Entwurfsdoppel Makro und Mikro ein.</p>","fields":{"slug":"/talks/2018-03-20-mikro_vs_makroarchitektur/"},"frontmatter":{"title":"Mikro- vs. Makroarchitektur – Spielraum und Spielregeln","date":"2018-03-20T00:00:00.000Z","tags":["architektur"],"poster":"/images/plakat_2018_03.png"}},"speakers":{"edges":[{"node":{"id":"94913f72-7647-5c8c-aa6c-7c0eb6896964","html":"<p>Von der Bayer AG über IBM und oose zu embarc. <strong>Stefan Zörner</strong> blickt auf zwanzig Jahre IT-Erfahrung\nzurück und stets gespannt nach vorn. Er unterstützt in Architektur- und Umsetzungsfragen mit dem Ziel, gute\nArchitekturansätze wirksam in der Implementierung zu verankern. Sein Wissen und seine Erfahrung teilt er regelmäßig in\nVorträgen, Artikeln und Workshops. Stefan ist Apache Committer, aktives Board-Mitglied im iSAQB und Autor des Buchs\n„Softwarearchitekturen dokumentieren und kommunizieren“ (Hanser Verlag).</p>","frontmatter":{"name":"Stefan Zörner","pic":"/images/stefan_zoerner.jpg","twitter_name":null},"fields":{"slug":"/speakers/stefan_zoerner/"}}}]},"location":{"fields":{"slug":"/locations/hochschule_campus/"},"frontmatter":{"name":"Hochschule Zittau/Görlitz","info":"Haus G2 Raum 0.10","zip":"02826","city":"Görlitz","street":"Brückenstraße"}}},"pageContext":{"slug":"/talks/2018-03-20-mikro_vs_makroarchitektur/","speakerSlugs":["/speakers/stefan_zoerner/"],"locationSlug":"/locations/hochschule_campus/"}}