{"data":{"talk":{"html":"<p>Haskell ist eine funktionale Programmiersprache, die das Paradigma der funktionalen Programmierung so konsequent\numsetzt, wie kaum eine andere Sprache. Beispielsweise sind Funktionen in Haskell standardmäßig \"pure\", können also keine\nSeiteneffekte besitzen, was durch das statische Typ-System sichergestellt wird. Eine weitere Eigenschaft, die Haskell\nvon den meisten anderen Sprachen unterscheidet, ist die nicht-strikte Auswertung von Ausdrücken, was im allgemeinen\ndurch Lazy-Evaluation umgesetzt wird. Dadurch kann Haskell beispielsweise ohne weiteres mit unendlichen Listen umgehen,\nohne dafür besondere Sprachkonstrukte zu benötigen.</p>\n<p>Haskell selbst läuft nicht auf der Java-VM, allerdings existiert mit der Programmiersprache \"Frege\" eine\nHaskell-Variante, die zu Java-Sourcecode kompiliert. Damit steht nun auch auf der JVM eine rein funktionale Sprache\nbereit.</p>","fields":{"slug":"/talks/2016-03-30-haskell_frege/"},"frontmatter":{"title":"Haskell und Frege","date":"2016-03-30T00:00:00.000Z","tags":["programmiersprachen","functional programming"],"poster":"../images/plakat_2016_03"}},"speakers":{"edges":[{"node":{"id":"1bc17afa-9379-5441-9245-72eb6b23c092","html":"<p>Manuel arbeitet als Softwareentwickler bei der Saxonia-Systems AG in Görlitz.\nEr beschäftigt sich mit allen Aspekten der Anwendungsentwicklung, wobei der Fokus auf dem Frontend liegt,\nbeispielsweise mit JavaFX und modernen JavaScript-Frameworks.\nDaneben interessieren ihn Themen wie funktionale Programmierung und Softwarearchitektur.\nManuel ist Gründungsmitglied und Leiter der Java User Group Görlitz und steuert hierfür und\nauch für andere Usergroups und Konferenzen regelmäßig Vorträge bei.</p>","frontmatter":{"name":"Manuel Mauky","pic":"https://lestard.eu/files/pics/me.png","twitter_name":"manuel_mauky"},"fields":{"slug":"/speakers/manuel_mauky/"}}}]},"location":{"fields":{"slug":"/locations/hochschule_campus/"},"frontmatter":{"name":"Hochschule Zittau/Görlitz","info":"Haus G2 Raum 0.10","zip":"02826","city":"Görlitz","street":"Brückenstraße"}}},"pageContext":{"slug":"/talks/2016-03-30-haskell_frege/","speakerSlugs":["/speakers/manuel_mauky/"],"locationSlug":"/locations/hochschule_campus/"}}