{"data":{"talk":{"html":"<p>Beim Bauen monolithischer Systeme nutzen Entwicklerteams eine Reihe typischer Muster um die Interaktion verschiedener\nSystemteile zu implementieren. Behält man diese Interaktionsmuster bei, während man ein System in verschiedene aufteilt,\nergeben sich oft große Komplexität und architektonische Nachteile, die oft die ursprüngliche Idee, die hinter der\nAufteilung stand, konterkarieren.</p>\n<p>Der Vortrag betrachtet ein konkretes Beispiel von Modulinteraktion in einem monolithischen System und identifiziert die\nProblemstellungen die sich ergeben, wenn man dieses System in exakt dem gleichen Interaktionsstil aufteilt. Danach wird\neine alternative Implementierungsstrategie für das monolithische System diskutiert, die die Modularität des\nUrsprungssystems stark verbessert und im Falle einer Aufteilung in unabhängige Teilsysteme zu einer besseren Architektur\nführt.</p>\n<p><a href=\"https://speakerdeck.com/olivergierke/refactoring-to-a-system-of-systems\">Folien zum Vortrag</a></p>","fields":{"slug":"/talks/2018-01-31-system_of_systems/"},"frontmatter":{"title":"Refactoring to a System of Systems","date":"2018-01-31T00:00:00.000Z","tags":["architektur"],"poster":"../images/plakat_2018_01.png"}},"speakers":{"edges":[{"node":{"id":"101a413c-0078-5de0-8c1b-bb0bc330fa2a","html":"<p><strong>Oliver Gierke</strong> ist Leiter des Spring Data Projekts bei Pivotal. Seit über 10 Jahren widmet er sich dem Entwickeln von\nJava Enterprise Applikationen, Open Source Projekten und ist Mitglied der JPA Expert Group. Seine Arbeitsschwerpunkte\nliegen im Bereich Softwarearchitektur, Domain-Driven Design, REST, Spring und Persistenztechnologien. Er ist\nregelmäßiger Sprecher auf deutschen und internationalen Konferenzen sowie Autor von Fachartikeln und des ersten Spring\nData Buches.</p>","frontmatter":{"name":"Oliver Gierke","pic":"/images/oliver_gierke.png","twitter_name":"olivergierke"},"fields":{"slug":"/speakers/oliver_gierke/"}}}]},"location":{"fields":{"slug":"/locations/saxsys/"},"frontmatter":{"name":"Saxonia Systems AG","info":null,"zip":"02826","city":"Görlitz","street":"Berliner Straße"}}},"pageContext":{"slug":"/talks/2018-01-31-system_of_systems/","speakerSlugs":["/speakers/oliver_gierke/"],"locationSlug":"/locations/saxsys/"}}